Conf.Simple/src/Catalogs/SUI_НастройкиДокументовОбмена/SUI_НастройкиДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>SUI_НастройкиДокументовОбмена</name>
  <attributes>
    <name>Используется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяМетаданныхДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СинонимМетаданныхДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СоздаватьДокументОбменаПриЗаписиДокумента1С</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПоУмолчанию</name>
    <type>
      <types>EnumRef.SUI_СостоянияДокументовОбмена</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ГрупповоеСканирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьВДокумент1СПослеОбмена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроводитьДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеСхемыКомпоновкиДанных</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекОтбораДокументов</name>
    <comment>Настройки компоновки данных содержащие элементы отбора</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроекРеквизитовДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПередЗаписью</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>АлгоритмПослеЗаписи</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НастройкиТаблиц</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипТаблицы</name>
      <type>
        <types>EnumRef.SUI_ТипыТаблицДокументовОбмена</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяТабличнойЧасти</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПропускатьНеЗаполненные</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ХранилищеНастроекРеквизитовТаблицы</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмОбработкиСтрокЗагрузкиДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостобработкаЗаполнениеРеквизитов</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПостобработкаСозданиеДокументовНаОсновании</name>
    <attributes>
      <name>ИмяДокумента</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПриРасхождении</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеПриЗаписи</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>АлгоритмОбработчик</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НастройкиИдентификацииСтрок</name>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Реквизит</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Conf.Simple/src/Enums/SUI_ТипыДокументовОбмена/SUI_ТипыДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТипыДокументовОбмена</name>
  <enumValues>
    <name>Документ</name>
  </enumValues>
  <enumValues>
    <name>АдресноеХранениеОтбор</name>
  </enumValues>
  <enumValues>
    <name>АдресноеХранениеРазмещение</name>
  </enumValues>
  <enumValues>
    <name>СборШтрихкодов</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Enums/SUI_ТипыТаблицДокументовОбмена/SUI_ТипыТаблицДокументовОбмена.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>SUI_ТипыТаблицДокументовОбмена</name>
  <enumValues>
    <name>Отбор</name>
  </enumValues>
  <enumValues>
    <name>Размещение</name>
  </enumValues>
  <enumValues>
    <name>Товары</name>
  </enumValues>
  <enumValues>
    <name>ШтрихкодыУпаковок</name>
  </enumValues>
  <enumValues>
    <name>ПотокШтрихкодов</name>
  </enumValues>
  <enumValues>
    <name>Серии</name>
  </enumValues>
</mdclass:Enum>

Conf.Simple/src/Catalogs/SUI_НастройкиДокументовОбмена/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

//@skip-check export-procedure-missing-comment
#Область ПрограммныйИнтерфейс

Функция НастройкиПоДокументу(ДокументСсылка, ТолькоИспользуемые = Истина, ПараметрыЗапроса = Неопределено) Экспорт
	
	Настройки = Новый Массив();
	
	Если SUI_ОбщегоНазначенияПереопределяемый.ЭтоСсылкаДокумента(ДокументСсылка) Тогда
		
		МетаданныеДокумента = Метаданные.НайтиПоТипу(ТипЗнч(ДокументСсылка));
		
		Если МетаданныеДокумента <> Неопределено Тогда
			
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ
				|	Ссылка,
				|	ХранилищеСхемыКомпоновкиДанных КАК Схема,
				|	ХранилищеНастроекОтбораДокументов КАК НастройкиОтбора
				|ИЗ
				|	Справочник.SUI_НастройкиДокументовОбмена
				|ГДЕ
				|	ИмяМетаданныхДокумента = &ИмяМетаданныхДокумента
				|	И ВЫБОР
				|		КОГДА &ТолькоИспользуемые
				|			ТОГДА Используется
				|			И НЕ ПометкаУдаления
				|		ИНАЧЕ ИСТИНА
				|	КОНЕЦ
				|	&ДополнительныеПараметры";
			
			Запрос.УстановитьПараметр("ИмяМетаданныхДокумента", МетаданныеДокумента.Имя);
			Запрос.УстановитьПараметр("ТолькоИспользуемые", ТолькоИспользуемые);
			
			ДополнительныеПараметры = Новый Массив();
			
			ОписаниеТипаСтруктура = Новый ОписаниеТипов("Структура");
			Для Каждого ПараметрЗапроса Из ОписаниеТипаСтруктура.ПривестиЗначение(ПараметрыЗапроса) Цикл
				ДополнительныеПараметры.Добавить(ПараметрЗапроса.Ключ + " = &" + ПараметрЗапроса.Ключ);
				Запрос.УстановитьПараметр(ПараметрЗапроса.Ключ, ПараметрЗапроса.Значение);
			КонецЦикла;
			
			ДополнительныеПараметры = СтрСоединить(ДополнительныеПараметры, Символы.ПС + Символы.Таб + "И ");
			
			Если Не ПустаяСтрока(ДополнительныеПараметры) Тогда
				ДополнительныеПараметры = "И " + ДополнительныеПараметры;
			КонецЕсли;
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ДополнительныеПараметры", ДополнительныеПараметры);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			Если Не РезультатЗапроса.Пустой() Тогда
				
				Выборка = РезультатЗапроса.Выбрать();
				
				Пока Выборка.Следующий() Цикл
					
					Если СсылкаДокументаСоответствуетНастройкеОтбора(ДокументСсылка, Выборка.Схема, Выборка.НастройкиОтбора) Тогда
						Настройки.Добавить(Выборка.Ссылка);
					КонецЕсли;
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Настройки;
	
КонецФункции

Функция СформироватьДанныеНастройки(НастройкаСсылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НастройкаСсылка", НастройкаСсылка);
	Запрос.УстановитьПараметр("ПустойУникальныйИдентификатор", SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.ПустойУникальныйИдентификатор());
	Запрос.Текст =
		"ВЫБРАТЬ
		|	НастройкиДокументовОбмена.Ссылка,
		|	НастройкиДокументовОбмена.Наименование,
		|	НастройкиДокументовОбмена.ПометкаУдаления,
		|	НастройкиДокументовОбмена.Используется,
		|	НастройкиДокументовОбмена.ИмяМетаданныхДокумента,
		|	НастройкиДокументовОбмена.СинонимМетаданныхДокумента,
		|	НастройкиДокументовОбмена.СоздаватьДокументОбменаПриЗаписиДокумента1С,
		|	НастройкиДокументовОбмена.СостояниеПоУмолчанию,
		|	НастройкиДокументовОбмена.КонтролироватьДокумент,
		|	НастройкиДокументовОбмена.ГрупповоеСканирование,
		|	НастройкиДокументовОбмена.ЗагружатьВДокумент1СПослеОбмена,
		|	НастройкиДокументовОбмена.ПроводитьДокумент,
		|	НастройкиДокументовОбмена.Комментарий,
		|	НастройкиДокументовОбмена.ХранилищеСхемыКомпоновкиДанных КАК СхемаКомпоновкиДанных,
		|	НастройкиДокументовОбмена.ХранилищеНастроекОтбораДокументов КАК НастройкиКомпоновкиОтборДокументов,
		|	НастройкиДокументовОбмена.ХранилищеНастроекРеквизитовДокумента КАК НастройкиКомпоновкиРеквизитыДокумента,
		|	НастройкиДокументовОбмена.АлгоритмПередЗаписью,
		|	НастройкиДокументовОбмена.АлгоритмПослеЗаписи
		|ИЗ
		|	Справочник.SUI_НастройкиДокументовОбмена КАК НастройкиДокументовОбмена
		|ГДЕ
		|	НастройкиДокументовОбмена.Ссылка = &НастройкаСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиСозданиеДокументовНаОсновании.ИмяДокумента,
		|	НастройкиСозданиеДокументовНаОсновании.ПриРасхождении,
		|	НастройкиСозданиеДокументовНаОсновании.ПроведениеПриЗаписи,
		|	НастройкиСозданиеДокументовНаОсновании.АлгоритмОбработчик
		|ИЗ
		|	Справочник.SUI_НастройкиДокументовОбмена.ПостобработкаСозданиеДокументовНаОсновании КАК
		|		НастройкиСозданиеДокументовНаОсновании
		|ГДЕ
		|	НастройкиСозданиеДокументовНаОсновании.Ссылка = &НастройкаСсылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НастройкиСозданиеДокументовНаОсновании.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиТаблиц.КлючСвязи,
		|	НастройкиТаблиц.ТипТаблицы,
		|	НастройкиТаблиц.ИмяТабличнойЧасти,
		|	НастройкиТаблиц.ПропускатьНеЗаполненные,
		|	НастройкиТаблиц.ХранилищеНастроекРеквизитовТаблицы КАК НастройкиКомпоновкиРеквизитыТаблицы,
		|	НастройкиТаблиц.АлгоритмОбработкиСтрокЗагрузкиДанных
		|ИЗ
		|	Справочник.SUI_НастройкиДокументовОбмена.НастройкиТаблиц КАК НастройкиТаблиц
		|ГДЕ
		|	НастройкиТаблиц.Ссылка = &НастройкаСсылка
		|
		|УПОРЯДОЧИТЬ ПО
		|	НастройкиТаблиц.НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиИдентификацииСтрок.КлючСвязи,
		|	НастройкиИдентификацииСтрок.Реквизит
		|ИЗ
		|	Справочник.SUI_НастройкиДокументовОбмена.НастройкиИдентификацииСтрок КАК НастройкиИдентификацииСтрок
		|ГДЕ
		|	НастройкиИдентификацииСтрок.Ссылка = &НастройкаСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НастройкиЗаполненияРеквизитовДокумента.КлючСвязи,
		|	НастройкиЗаполненияРеквизитовДокумента.Реквизит,
		|	НастройкиЗаполненияРеквизитовДокумента.Значение,
		|	НастройкиЗаполненияРеквизитовДокумента.ПриРасхождении
		|ИЗ
		|	Справочник.SUI_НастройкиДокументовОбмена.ПостобработкаЗаполнениеРеквизитов КАК НастройкиЗаполненияРеквизитовДокумента
		|ГДЕ
		|	НастройкиЗаполненияРеквизитовДокумента.Ссылка = &НастройкаСсылка";
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	Если РезультатыЗапроса[0].Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаОсновныеДанные = РезультатыЗапроса[0].Выбрать();
	ВыборкаПостобработкаСозданиеДокументов = РезультатыЗапроса[1].Выбрать();
	ВыборкаНастройкиТаблиц = РезультатыЗапроса[2].Выбрать();
	ВыборкаНастройкиИдентификацииСтрок = РезультатыЗапроса[3].Выбрать();
	ВыборкаПостобработкаЗаполненияРеквизитов = РезультатыЗапроса[4].Выбрать();
	
	ВыборкаОсновныеДанные.Следующий();
	
	// Основные данные
	ДанныеНастройки = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ВыборкаОсновныеДанные);
	ДанныеНастройки.СхемаКомпоновкиДанных = ПолучитьИзХранилищаЗначений(ДанныеНастройки.СхемаКомпоновкиДанных, Тип("СхемаКомпоновкиДанных"));
	ДанныеНастройки.НастройкиКомпоновкиОтборДокументов = ПолучитьИзХранилищаЗначений(
		ДанныеНастройки.НастройкиКомпоновкиОтборДокументов, Тип("НастройкиКомпоновкиДанных"));
	
	// ТипДокумента
	ДанныеНастройки.Вставить("ТипДокумента", ОпределитьТипДокументаПоНастроеннымТаблицам(ВыборкаНастройкиТаблиц));
	ВыборкаНастройкиТаблиц.Сбросить();
	
	// РеквизитыДокумента
	ДанныеНастройки.Вставить("РеквизитыДокумента", Новый Структура());
	
	// РеквизитыДокумента.НастройкиКомпоновки
	ДанныеНастройки.РеквизитыДокумента.Вставить("НастройкиКомпоновки", ПолучитьИзХранилищаЗначений(
		ДанныеНастройки.НастройкиКомпоновкиРеквизитыДокумента, Тип("НастройкиКомпоновкиДанных")));
	ДанныеНастройки.Удалить("НастройкиКомпоновкиРеквизитыДокумента");
	
	ПараметрыПоиска = Новый Структура();
	ПараметрыПоиска.Вставить("КлючСвязи", SUI_ОбщегоНазначенияКлиентСерверПереопределяемый.ПустойУникальныйИдентификатор());
	
	// Постобработка
	ДанныеНастройки.Вставить("Постобработка", Новый Структура());
	
	// Постобработка.ЗаполнениеРеквизитов
	ДанныеНастройки.Постобработка.Вставить("ЗаполнениеРеквизитов", Новый Структура());
	Пока ВыборкаПостобработкаЗаполненияРеквизитов.НайтиСледующий(ПараметрыПоиска) Цикл
		ДанныеНастройки.Постобработка.ЗаполнениеРеквизитов.Вставить(
			ВыборкаПостобработкаЗаполненияРеквизитов.Реквизит, 
			ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ВыборкаПостобработкаЗаполненияРеквизитов));
	КонецЦикла;
	
	// Постобработка.НастройкиСозданияДокументовНаОсновании
	ДанныеНастройки.Постобработка.Вставить("СозданиеДокументовНаОсновании", Новый Массив());
	Пока ВыборкаПостобработкаСозданиеДокументов.Следующий() Цикл
		ДанныеНастройки.Постобработка.СозданиеДокументовНаОсновании.Добавить(
			ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ВыборкаПостобработкаСозданиеДокументов));
	КонецЦикла;
	
	// НастройкиТаблиц
	ДанныеНастройки.Вставить("НастройкиТаблиц", Новый Соответствие());
	// ДанныеНастройки.ПорядокНастройкиТаблиц.*
	ДанныеНастройки.Вставить("ПорядокНастройкиТаблиц", Новый Массив());
	
	ДоступныеТипаТаблиц = ДоступныеТипыТаблицПоТипуДокумента(ДанныеНастройки.ТипДокумента);
	
	Пока ВыборкаНастройкиТаблиц.Следующий() Цикл
		
		Если ДоступныеТипаТаблиц.Найти(ВыборкаНастройкиТаблиц.ТипТаблицы) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыПоиска.КлючСвязи = ВыборкаНастройкиТаблиц.КлючСвязи;
		
		// НастройкаТаблицы
		НастройкаТаблицы = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ВыборкаНастройкиТаблиц);
		
		// НастройкаТаблицы.НастройкиКомпоновки
		НастройкаТаблицы.Вставить("НастройкиКомпоновки", ПолучитьИзХранилищаЗначений(
			НастройкаТаблицы.НастройкиКомпоновкиРеквизитыТаблицы, Тип("НастройкиКомпоновкиДанных")));
		НастройкаТаблицы.Удалить("НастройкиКомпоновкиРеквизитыТаблицы");
		
		// НастройкаТаблицы.Постобработка
		НастройкаТаблицы.Вставить("Постобработка", Новый Структура());
		
		// НастройкаТаблицы.Постобработка.ЗаполнениеРеквизитов
		НастройкаТаблицы.Постобработка.Вставить("ЗаполнениеРеквизитов", Новый Структура());
		ВыборкаПостобработкаЗаполненияРеквизитов.Сбросить();
		Пока ВыборкаПостобработкаЗаполненияРеквизитов.НайтиСледующий(ПараметрыПоиска) Цикл
			НастройкаТаблицы.Постобработка.ЗаполнениеРеквизитов.Вставить(
				ВыборкаПостобработкаЗаполненияРеквизитов.Реквизит, 
				ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(ВыборкаПостобработкаЗаполненияРеквизитов));
		КонецЦикла;
		
		// НастройкаТаблицы.РеквизитыИдентификации
		НастройкаТаблицы.Вставить("РеквизитыИдентификации", Новый Массив());
		ВыборкаНастройкиИдентификацииСтрок.Сбросить();
		Пока ВыборкаНастройкиИдентификацииСтрок.НайтиСледующий(ПараметрыПоиска) Цикл
			НастройкаТаблицы.РеквизитыИдентификации.Добавить(ВыборкаНастройкиИдентификацииСтрок.Реквизит);
		КонецЦикла;
		
		// НастройкаТаблицы.СоответствиеРеквизитов
		НастройкаТаблицы.Вставить("СоответствиеРеквизитов", СоответствиеРеквизитовИзНастройкиКомпоновки(
			НастройкаТаблицы.НастройкиКомпоновки, 
			SUI_НастройкиДокументовКлиентСервер.ПолучитьИменаОсновныхРеквизитовТаблиц(Ложь, ВыборкаНастройкиТаблиц.ТипТаблицы),
			НастройкаТаблицы.ИмяТабличнойЧасти));
		
		// ДанныеНастройки.НастройкиТаблиц.* НастройкаТаблицы
		ДанныеНастройки.НастройкиТаблиц.Вставить(ВыборкаНастройкиТаблиц.ТипТаблицы, НастройкаТаблицы);
		// ДанныеНастройки.ПорядокНастройкиТаблиц.*
		ДанныеНастройки.ПорядокНастройкиТаблиц.Добавить(ВыборкаНастройкиТаблиц.ТипТаблицы);
		
	КонецЦикла;
	
	Возврат ДанныеНастройки;
	
КонецФункции

Функция ТипДокументаПоНастройке(НастройкаДокумента) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатЗапроса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаДокумента, "НастройкиТаблиц.ТипТаблицы");
	Возврат ОпределитьТипДокументаПоНастроеннымТаблицам(РезультатЗапроса.Выбрать());
	
КонецФункции

Функция НастроенныеТипыТаблиц(НастройкаДокумента) Экспорт
	
	Возврат Новый ФиксированныйМассив(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(НастройкаДокумента, "НастройкиТаблиц.ТипТаблицы")
		.Выгрузить().ВыгрузитьКолонку("ТипТаблицы"));
	
КонецФункции

Функция ДоступныеТипыТаблицПоТипуДокумента(ТипДокумента) Экспорт
	
	ДоступныеТипыТаблиц = Новый Массив();
	
	Если ТипДокумента = Перечисления.SUI_ТипыДокументовОбмена.СборШтрихкодов Тогда
		ДоступныеТипыТаблиц.Добавить(Перечисления.SUI_ТипыТаблицДокументовОбмена.ПотокШтрихкодов);
	ИначеЕсли ТипДокумента <> Неопределено Тогда
		
		ДоступныеТипыТаблиц.Добавить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Серии);
		ДоступныеТипыТаблиц.Добавить(Перечисления.SUI_ТипыТаблицДокументовОбмена.ШтрихкодыУпаковок);
		
		Если ТипДокумента = Перечисления.SUI_ТипыДокументовОбмена.Документ Тогда
			ДоступныеТипыТаблиц.Добавить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары);
		ИначеЕсли ТипДокумента = Перечисления.SUI_ТипыДокументовОбмена.АдресноеХранениеОтбор Тогда
			ДоступныеТипыТаблиц.Добавить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор);
		ИначеЕсли ТипДокумента = Перечисления.SUI_ТипыДокументовОбмена.АдресноеХранениеРазмещение Тогда
			ДоступныеТипыТаблиц.Добавить(Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ДоступныеТипыТаблиц;
	
КонецФункции

Функция ПолучитьДоступныеНастроенныеТипыТаблиц(НастройкаДокумента, ТипДокумента) Экспорт
	
	НастроенныеТипыТаблиц = Новый Массив();
	
	Если ЗначениеЗаполнено(НастройкаДокумента) И ОбщегоНазначения.СсылкаСуществует(НастройкаДокумента) Тогда
		
		ДоступныеТипыТаблиц = ДоступныеТипыТаблицПоТипуДокумента(ТипДокумента);
		
		Для Каждого НастроенныйТипТаблицы Из НастроенныеТипыТаблиц(НастройкаДокумента) Цикл
			Если ДоступныеТипыТаблиц.Найти(НастроенныйТипТаблицы) <> Неопределено Тогда
				НастроенныеТипыТаблиц.Добавить(НастроенныйТипТаблицы);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(НастроенныеТипыТаблиц);
	
КонецФункции

Функция ПолучитьНастроенныеТипы() Экспорт
	
	НастроенныеТипы = Новый Массив();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИмяМетаданныхДокумента
		|ИЗ
		|	Справочник.SUI_НастройкиДокументовОбмена";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НастроенныеТипы.Добавить(Тип("ДокументСсылка." + Выборка.ИмяМетаданныхДокумента));	
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат НастроенныеТипы;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Наименование");
	Поля.Добавить("СинонимМетаданныхДокумента");
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Представление = Данные.Наименование + " (" + Данные.СинонимМетаданныхДокумента + ")";
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьМетаданныеДокумента(Источник) Экспорт
	
	МетаданныеДокумента = Неопределено;
	
	ТипЗначенияИсточника = ТипЗнч(Источник);
	Если ТипЗначенияИсточника = Тип("ОбъектМетаданных") Тогда
		
		Если Метаданные.Документы.Содержит(Источник) Тогда
			МетаданныеДокумента = Источник;
		КонецЕсли;
		
	Иначе
		
		Если ТипЗначенияИсточника = ТипЗнч(ПустаяСсылка()) Тогда
			ИмяМетаданныхДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Источник, "ИмяМетаданныхДокумента");
		ИначеЕсли ТипЗначенияИсточника = Тип("Строка") Тогда
			ИмяМетаданныхДокумента = Источник;
		Иначе
			ИмяМетаданныхДокумента = Источник.ИмяМетаданныхДокумента;
		КонецЕсли;
		
		Если Не ПустаяСтрока(ИмяМетаданныхДокумента) Тогда
			МетаданныеДокумента = ОбщегоНазначения.ОбъектМетаданныхПоПолномуИмени("Документ." + ИмяМетаданныхДокумента);
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат МетаданныеДокумента;
	
КонецФункции

Функция ПолучитьСхемуКомпоновкиДанных(Источник, ИмяТабличнойЧасти = "", ПараметрыСхемы = Неопределено, БезТаблиц = Ложь, АдресРезультата = "") Экспорт
	
	СхемаКомпоновкиДанных = Неопределено;
	
	МетаданныеДокумента = ПолучитьМетаданныеДокумента(Источник);
	
	Если МетаданныеДокумента <> Неопределено Тогда
		
		ПоляВыбора = Новый Массив();
		Если БезТаблиц Тогда
			
			Для Каждого ОписаниеРеквизита Из SUI_НастройкиДокументовПовтИсп.ОписаниеРеквизитовДокумента(МетаданныеДокумента.Имя)
				.Строки.Найти("Реквизиты", "Имя", Ложь).Строки Цикл
				ПоляВыбора.Добавить(ОписаниеРеквизита.Имя);
			КонецЦикла;
			
		Иначе
			ПоляВыбора.Добавить("*");
		КонецЕсли;
		
		СхемаКомпоновкиДанных = SUI_КомпоновкаДанныхСервер.ПустаяСхема();
		НаборДанных = SUI_КомпоновкаДанныхСервер.ДобавитьПустойНаборДанных(СхемаКомпоновкиДанных);
		НаборДанных.Запрос = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	" + СтрСоединить(ПоляВыбора, "," + Символы.ПС + Символы.Таб) + "
			|ИЗ
			|	" + МетаданныеДокумента.ПолноеИмя();
			
		Если Не ПустаяСтрока(ИмяТабличнойЧасти) Тогда
			
			Если МетаданныеДокумента.ТабличныеЧасти.Найти(ИмяТабличнойЧасти) = Неопределено Тогда
				СхемаКомпоновкиДанных = Неопределено;
			Иначе
				НаборДанных.Запрос = НаборДанных.Запрос + "." + ИмяТабличнойЧасти;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПараметрыСхемы) Тогда
			
			Условия = Новый Массив();
			Для Каждого ПараметрСхемы Из ПараметрыСхемы Цикл
				
				Условия.Добавить(ПараметрСхемы.Ключ + " = &" + ПараметрСхемы.Ключ);
				
				Если ПараметрСхемы.Значение <> Неопределено Тогда
					SUI_КомпоновкаДанныхСервер.ДобавитьПараметр(СхемаКомпоновкиДанных, ПараметрСхемы.Ключ, , 
						ПараметрСхемы.Значение, , Истина);
				КонецЕсли;
				
			КонецЦикла;
			
			НаборДанных.Запрос = НаборДанных.Запрос + "
			|ГДЕ
			|	" + СтрСоединить(Условия, "," + Символы.ПС + Символы.Таб);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(АдресРезультата) Тогда
			
			ТипЗначенияАдресРезультата = ТипЗнч(АдресРезультата);
			
			Если (ТипЗначенияАдресРезультата = Тип("Строка") И ЭтоАдресВременногоХранилища(АдресРезультата)) Или
				ТипЗначенияАдресРезультата = Тип("УникальныйИдентификатор") Тогда
				СхемаКомпоновкиДанных = ПоместитьВоВременноеХранилище(СхемаКомпоновкиДанных, АдресРезультата);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СхемаКомпоновкиДанных;
	
КонецФункции

Функция ПолучитьИзХранилищаЗначений(Хранилище, ОжидаемыйТип = Неопределено) Экспорт
	
	ТипЗначенияXML = XMLТипЗнч(Хранилище);
	Если ТипЗначенияXML <> Неопределено И ТипЗначенияXML.ИмяТипа = "ValueStorage" Тогда
		ПолученноеЗначение = Хранилище.Получить();
	Иначе
		ПолученноеЗначение = Хранилище;
	КонецЕсли;
	
	Если ОжидаемыйТип <> Неопределено Тогда
		ОписаниеОжидаемогоТипа = Новый ОписаниеТипов(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОжидаемыйТип));
		ПолученноеЗначение = ОписаниеОжидаемогоТипа.ПривестиЗначение(ПолученноеЗначение);
	КонецЕсли;
	
	Возврат ПолученноеЗначение;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СсылкаДокументаСоответствуетНастройкеОтбора(ДокументСсылка, Знач Схема, Знач НастройкиОтбора)
	
	Схема = ПолучитьИзХранилищаЗначений(Схема, Тип("СхемаКомпоновкиДанных"));
	SUI_КомпоновкаДанныхСервер.ДобавитьПараметр(Схема, "Ссылка", , ДокументСсылка, , Истина);
	
	НастройкиОтбора = ПолучитьИзХранилищаЗначений(НастройкиОтбора, Тип("НастройкиКомпоновкиДанных"));
	SUI_КомпоновкаДанныхКлиентСервер.ДобавитьВыбранноеПоле(НастройкиОтбора, "Ссылка");
	
	ПараметрыВыгрузкиРезультата = SUI_КомпоновкаДанныхСервер.ПараметрыРезультатСхемыКомпоновкиДанных();
	ПараметрыВыгрузкиРезультата.СхемаКомпоновкиДанных = Схема;
	ПараметрыВыгрузкиРезультата.НастройкиКомпоновкиДанных = НастройкиОтбора;
	ПараметрыВыгрузкиРезультата.ВыполнятьВПривилегированномРежиме = Истина;
	
	Возврат (SUI_КомпоновкаДанныхСервер.ВыгрузитьРезультатСхемыКомпоновкиДанных(ПараметрыВыгрузкиРезультата).Количество() > 0);
	
КонецФункции

Функция СоответствиеРеквизитовИзНастройкиКомпоновки(НастройкаКомпоновки, ОсновныеРеквизиты, ИмяТабличнойЧасти = "")
	
	СоответствиеРеквизитов = Новый Соответствие();
	
	ПользовательскиеПоля = Новый Соответствие();
	
	Для Каждого ЭлементПП Из НастройкаКомпоновки.ПользовательскиеПоля.Элементы Цикл
		
		Если ЭлементПП.Использование И 
			ПустаяСтрока(ЭлементПП.Заголовок) И 
			ЭлементПП.Варианты.Элементы.Количество() = 1 И
			ЭлементПП.Варианты.Элементы[0].Использование И
			ЭлементПП.Варианты.Элементы[0].Отбор.Элементы.Количество() = 0 И
			ТипЗнч(ЭлементПП.Варианты.Элементы[0].Значение) = ТипЗнч(Новый ПолеКомпоновкиДанных("")) Тогда
			
			Значение = Строка(ЭлементПП.Варианты.Элементы[0].Значение);
			
			Если ПустаяСтрока(ИмяТабличнойЧасти) Тогда
				//
			ИначеЕсли СтрНачинаетсяС(Значение, ИмяТабличнойЧасти + ".") Тогда
					
				Значение = СтрРазделить(Значение, ".", Ложь);
				Если Значение.Количество() = 2 Тогда
					ПользовательскиеПоля.Вставить(Строка(ЭлементПП.ПутьКДанным), Значение[1]);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для Каждого ЭлементВыбора Из НастройкаКомпоновки.Выбор.Элементы Цикл
		
		Если Не ЭлементВыбора.Использование Или ПустаяСтрока(ЭлементВыбора.Заголовок) Или
			ОсновныеРеквизиты.НайтиПоЗначению(ЭлементВыбора.Заголовок) = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ПолеСтрокой = Строка(ЭлементВыбора.Поле);
		
		Если СтрНачинаетсяС(ПолеСтрокой, "ПользовательскиеПоля.Поле") Тогда
			
			Значение = ПользовательскиеПоля.Получить(ПолеСтрокой);
			Если Значение <> Неопределено Тогда
				СоответствиеРеквизитов.Вставить(ЭлементВыбора.Заголовок, Значение);
			КонецЕсли;
			
		ИначеЕсли Не ПустаяСтрока(ИмяТабличнойЧасти) И СтрНачинаетсяС(ПолеСтрокой, ИмяТабличнойЧасти + ".") Тогда
			
			Значение = СтрРазделить(ПолеСтрокой, ".", Ложь);
			Если Значение.Количество() = 2 Тогда
				СоответствиеРеквизитов.Вставить(ЭлементВыбора.Заголовок, Значение[1]);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Новый ФиксированноеСоответствие(СоответствиеРеквизитов);
	
КонецФункции

Функция ОпределитьТипДокументаПоНастроеннымТаблицам(ВыборкаТаблиц)
	
	ТипДокумента = Неопределено;
	
	Пока ВыборкаТаблиц.Следующий() Цикл
		
		ТипДокумента = ТипДокументаПоТипуТаблицы(ВыборкаТаблиц.ТипТаблицы);
		
		Если ТипДокумента <> Неопределено И ТипДокумента <> Перечисления.SUI_ТипыДокументовОбмена.ПустаяСсылка() Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТипДокумента;
	
КонецФункции

Функция ТипДокументаПоТипуТаблицы(ТипТаблицы)
	
	Если ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Товары Тогда
		Возврат Перечисления.SUI_ТипыДокументовОбмена.Документ;
	ИначеЕсли ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Отбор Тогда
		Возврат Перечисления.SUI_ТипыДокументовОбмена.АдресноеХранениеОтбор;
	ИначеЕсли ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.Размещение Тогда
		Возврат Перечисления.SUI_ТипыДокументовОбмена.АдресноеХранениеРазмещение;
	ИначеЕсли ТипТаблицы = Перечисления.SUI_ТипыТаблицДокументовОбмена.ПотокШтрихкодов Тогда
		Возврат Перечисления.SUI_ТипыДокументовОбмена.СборШтрихкодов;
	Иначе
		Возврат Перечисления.SUI_ТипыДокументовОбмена.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
